# Pandas

- In general when we deal with data pandas libray is used very commonly due to some important functions in data science
    - data analysis
    - data cleaning
    - data exploration
    - data manipulation
    
- Pandas - Panel Data and python data analysis it's a multidimensional data involving measurements over time
- Pandas alone cannot perform. It is built on numPy, as it can also handle ndimensional array. So both libraries required
<br>
- Features - series obj & data frame,aligns data, slicing, indexing, subseting, handles missing data, groups by functionality
- Features - merging & joining, labeling of axes hierarchially, time-series functionality, reshaping & robust input/output tool
<br>
- Pandas - great for > 500k rows, works great for tabular data, arbitrary matrix & time series matrix
- Numpy - < 500k rows, however memory efficinet

In [2]:
# Import pandas library
import pandas as pd
import numpy as np # as required for pandas

In [ ]:
# Check version of pandas
print(pd.__version__)

1.3.4

## Data structures in pandas

## Series
- 1 dimension (just like a column in a table.

## Dataframe
- 2 dimensions (tabular format just like excel)

### Creating Series

In [ ]:
age = [14, 12, 13] # age is a list
age_var = pd.Series(age)
age_var

0    14
1    12
2    13
dtype: int64

It also gives index as defualt.

In [ ]:
age = pd.Series([14, 12, 13]) # age is a list
age

0    14
1    12
2    13
dtype: int64

- We can also change the index. In general we call it as a label

In [ ]:
# Adding labels in series
age = pd.Series([14, 12, 13], index = ["Shailesh", "Sai", "Harsha"]) # age is a list
age

Shailesh    14
Sai         12
Harsha       A
dtype: object

In [ ]:
# Check Sai's age
age['Sai']

12

There is no column indexing as it just have one dimension

### Creating a Dataframe

In [ ]:
# creating a dataframe from a list
data = [12,22,33,44]
df = pd.DataFrame(data)
df

    0
0  12
1  22
2  33
3  44

In [ ]:
# adding index and column name
data = [12,22,33,44]
df = pd.DataFrame(data, index = ["Shailesh", "Sai", "Harsha", "Jagdeesh"], columns = ['age'])
df

          age
Shailesh   12
Sai        22
Harsha     33
Jagdeesh   44

In [ ]:
#creating a dataframe using a dictionary
dictionary = {'fruits' : ['apples', 'banana', 'mangoes'], 'count' :[10,20,15]}
df = pd.DataFrame(dictionary)
df

    fruits  count
0   apples     10
1   banana     20
2  mangoes     15

In [ ]:
#creating a dataframe using a series
series = pd.Series([6,12], index = ['a','b'])
df = pd.DataFrame(series)
df

    0
a   6
b  12

In [ ]:
#creating a data frame using numpy array
numpyarray = np.array([[50000,60000], ['John','James']])
df = pd.DataFrame({'name': numpyarray[1], 'salary': numpyarray[0]})
df

    name salary
0   John  50000
1  James  60000

### Merging two data frames

![types-of-joins.png](attachment:types-of-joins.png)

In [ ]:
player = ['Player1','Player2','Player3']
point = [8,9,6]
title = ['Game1','Game2','Game3']
df1 = pd.DataFrame({'Player':player, 'Points': point, 'Title': title})
df1

    Player  Points  Title
0  Player1       8  Game1
1  Player2       9  Game2
2  Player3       6  Game3

In [ ]:
player = ['Player1', 'Player5', 'Player6']
power = ['Punch', 'kick', 'Elbow']
title = ['Game1', 'Game5','Game6']
df2 = pd.DataFrame({'Player': player, 'Power': power, 'Title': title})
df2

    Player  Power  Title
0  Player1  Punch  Game1
1  Player5   kick  Game5
2  Player6  Elbow  Game6

In [ ]:
df1['Player'].equals(df2['Player'])

False

In [ ]:
#inner merge
df1.merge(df2, on='Player', how='inner')

    Player  Points Title_x  Power Title_y
0  Player1       8   Game1  Punch   Game1

In [ ]:
df1.merge(df2) # by default it is inner

    Player  Points  Title  Power
0  Player1       8  Game1  Punch

In [ ]:
#left merge
#all tables would be merged together but bcoz player 2&3 aren't available in 2nd table we have NaN against them
df1.merge(df2, on='Player', how='left')

    Player  Points Title_x  Power Title_y
0  Player1       8   Game1  Punch   Game1
1  Player2       9   Game2    NaN     NaN
2  Player3       6   Game3    NaN     NaN

In [ ]:
#right merge
df1.merge(df2, on='Player', how='right')

    Player  Points Title_x  Power Title_y
0  Player1     8.0   Game1  Punch   Game1
1  Player5     NaN     NaN   kick   Game5
2  Player6     NaN     NaN  Elbow   Game6

In [ ]:
#outer merge
df1.merge(df2, on='Player', how='outer')

    Player  Points Title_x  Power Title_y
0  Player1     8.0   Game1  Punch   Game1
1  Player2     9.0   Game2    NaN     NaN
2  Player3     6.0   Game3    NaN     NaN
3  Player5     NaN     NaN   kick   Game5
4  Player6     NaN     NaN  Elbow   Game6

### Join two dataframes

In [ ]:
player = ['Player1','Player2','Player3']
point = [8,9,6]
title = ['Game1','Game2','Game3']
df3 = pd.DataFrame({'Player':player, 'Points': point, 'Title': title}, index=['L1','L2','L3'])
df3

     Player  Points  Title
L1  Player1       8  Game1
L2  Player2       9  Game2
L3  Player3       6  Game3

In [ ]:
player = ['Player1', 'Player5', 'Player6']
power = ['Punch', 'Kick', 'Elbow']
title = ['Game1', 'Game5', 'Game6']
df4 = pd.DataFrame({'Players':player, 'Power':power, 'Titles':title}, index=['L2','L3','L4'])
df4

    Players  Power Titles
L2  Player1  Punch  Game1
L3  Player5   Kick  Game5
L4  Player6  Elbow  Game6

In [ ]:
#inner join
df3.join(df4, how='inner')

     Player  Points  Title  Players  Power Titles
L2  Player2       9  Game2  Player1  Punch  Game1
L3  Player3       6  Game3  Player5   Kick  Game5

In [ ]:
#left join
df3.join(df4, how='left')

     Player  Points  Title  Players  Power Titles
L1  Player1       8  Game1      NaN    NaN    NaN
L2  Player2       9  Game2  Player1  Punch  Game1
L3  Player3       6  Game3  Player5   Kick  Game5

In [ ]:
#outer join
df3.join(df4, how='outer')

     Player  Points  Title  Players  Power Titles
L1  Player1     8.0  Game1      NaN    NaN    NaN
L2  Player2     9.0  Game2  Player1  Punch  Game1
L3  Player3     6.0  Game3  Player5   Kick  Game5
L4      NaN     NaN    NaN  Player6  Elbow  Game6

### Join multiple dataframes

In [ ]:
### merging multiple dataframes
player = ['Player1','Player2','Player3', 'Player4']
score = [88,92,63, 22]
df1 = pd.DataFrame({'Player':player, 'Scores': score})
print(df1)

player = ['Player1','Player2','Player4']
wicket = [0,1,5]
df2 = pd.DataFrame({'Player':player, 'Wickets': wicket})
print(df2)

player = ['Player4','Player2','Player3']
catches = [0, 2, 1]
df3 = pd.DataFrame({'Player':player, 'Catch': catches})
print(df3)

player = ['Player4','Player5','Player3']
fifty = [0, 2, 1]
df4 = pd.DataFrame({'Player':player, 'Fifty': fifty})
print(df4)

In [ ]:
from functools import reduce
data_frames = [df1, df2, df3, df4]
df_merged = reduce(lambda  a,b: pd.merge(a, b ,on=['Player'],
                                            how='outer'), data_frames)

df_merged

### Concatenate dataframes

In [ ]:
pd.concat([df3,df4])

     Player  Points  Title  Players  Power Titles
L1  Player1     8.0  Game1      NaN    NaN    NaN
L2  Player2     9.0  Game2      NaN    NaN    NaN
L3  Player3     6.0  Game3      NaN    NaN    NaN
L2      NaN     NaN    NaN  Player1  Punch  Game1
L3      NaN     NaN    NaN  Player5   Kick  Game5
L4      NaN     NaN    NaN  Player6  Elbow  Game6

## Importing and analysis of a file

In [ ]:
# importing file from a local folder
from google.colab import files
uploaded = files.upload()

Saving mtcars_missing.csv to mtcars_missing.csv

In [ ]:
cars = pd.read_csv("mtcars_missing.csv") # read Crop data files
#print output
cars

In [ ]:
#to check the type of data provided
type(cars)

pandas.core.frame.DataFrame

In [ ]:
#to read the first 5 records
cars.head()

,Type,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [ ]:
#to read last 5 records
cars.tail()

,Type,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
27,Lotus Europa,30.4,4,95.1,113,3.77,1.513,16.9,1,1,5,2
28,Ford Pantera L,15.8,8,351.0,264,4.22,3.170,14.5,0,1,5,4
29,Ferrari Dino,19.7,6,145.0,175,3.62,2.770,15.5,0,1,5,6
30,Maserati Bora,15.0,8,301.0,335,3.54,3.570,14.6,0,1,5,8
31,Volvo 142E,21.4,4,121.0,109,4.11,2.780,18.6,1,1,4,2

In [ ]:
# to check the no of rows & columns in a data frame
cars.shape

(32, 12)

In [ ]:
cars.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 12 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Type    32 non-null     object
 1   mpg     32 non-null     float64
 2   cyl     32 non-null     int64
 3   disp    32 non-null     float64
 4   hp      32 non-null     int64
 5   drat    32 non-null     float64
 6   wt      32 non-null     float64
 7   qsec    32 non-null     float64
 8   vs      32 non-null     int64
 9   am      32 non-null     int64
 10  gear    32 non-null     int64
 11  carb    32 non-null     int64
dtypes: float64(5), int64(6), object(1)
memory usage: 3.1+ KB

In [ ]:
# drop unwanted column
cars_drop = cars.drop(columns=['vs', 'qsec'])
cars_drop.head()

                Type   mpg  cyl   disp   hp  drat     wt  am  gear  carb
0          Mazda RX4  21.0    6  160.0  110  3.90  2.620   1     4     4
1      Mazda RX4 Wag  21.0    6  160.0  110  3.90  2.875   1     4     4
2         Datsun 710  22.8    4  108.0   93  3.85  2.320   1     4     1
3     Hornet 4 Drive  21.4    6  258.0  110  3.08  3.215   0     3     1
4  Hornet Sportabout  18.7    8  360.0  175  3.15  3.440   0     3     2

### Statistical analysis

In [ ]:
# basic statistical analysis
#cars.mean()
# cars.median()
# cars.mode()
# cars.std()
# cars.max()
# cars.min()
# cars.count()
cars.describe(include = "all")

,Type,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
count,32,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.000000,32.0000
unique,32,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,Mazda RX4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,NaN,20.090625,6.187500,230.721875,146.687500,3.596563,3.217250,17.848750,0.437500,0.406250,3.687500,2.8125
std,NaN,6.026948,1.785922,123.938694,68.562868,0.534679,0.978457,1.786943,0.504016,0.498991,0.737804,1.6152
min,NaN,10.400000,4.000000,71.100000,52.000000,2.760000,1.513000,14.500000,0.000000,0.000000,3.000000,1.0000
25%,NaN,15.425000,4.000000,120.825000,96.500000,3.080000,2.581250,16.892500,0.000000,0.000000,3.000000,2.0000
50%,NaN,19.200000,6.000000,196.300000,123.000000,3.695000,3.325000,17.710000,0.000000,0.000000,4.000000,2.0000
75%,NaN,22.800000,8.000000,326.000000,180.000000,3.920000,3.610000,18.900000,1.000000,1.000000,4.000000,4.0000
max,NaN,33.900000,8.000000,472.000000,335.000000,4.930000,5.424000,22.900000,1.000000,1.000000,5.000000,8.0000

### Indexing and slicing

## loc vs iloc

The Pandas offers .loc[] and .iloc[] methods for data slicing.

- The **.loc[] method is a label based method** that means it takes names or labels of the index when taking the slices, whereas **.iloc[] method is based on the index's position**. It behaves like a regular slicing where we just have to indicate the positional index number and simply get the appropriate slice.

### iloc

In [ ]:
#to view entire row & 4th column from DS [: is the row, 4 is the column no]
#we are viewing hp coulmn only
cars.iloc[:,4]

In [ ]:
#first 5 records of hp column
cars.iloc[0:5,4]

### loc

In [ ]:
# read data set and store it in data frame
#see all record of mpg column
only_mpg = cars.loc[:,"mpg"]
only_mpg

In [ ]:
#display records from index 0 to index 6 from mpg columns
cars.loc[:6,"mpg"]

In [ ]:
#see 1st 7 records from mpg to qsec column
cars.loc[:6,"mpg":"qsec"]

### Reading columns

In [ ]:
# reading column name
cars.columns

In [ ]:
# reading just one column
cars.mpg

In [ ]:
cars.am

### Renaming columns

In [ ]:
cars=cars.rename(columns={'disp' : 'displacement'})
cars.head()

In [ ]:
cars.head()

### sort

In [ ]:
#now let us create our own datasets and perform the operations

students = [ ('Jack', 34, 'Sydney') ,

             ('Riti', 31, 'Delhi' ) ,

             ('Aadi', 16, 'New York') ,

             ('Riti', 32, 'Delhi' ) ,

             ('Riti', 33, 'Delhi' ) ,

             ('Riti', 35, 'Mumbai' ),

             ('Ajay', 21, 'Hyderabad')

             ]

#create a dataframe object
df3=pd.DataFrame(students,columns=['Name','Marks','City'], index=['b','a','f','e','d','c','g'])
df3

In [ ]:
#observe the difference between below 3 operations on sort function

#let us perform the sort by index
df3.sort_index() # sorted by index only

In [ ]:
# sorting in ascending order

df3.sort_index(axis=0, ascending=False)
#axis = 0 is by row

   Name  Marks       City
g  Ajay     21  Hyderabad
f  Aadi     16   New York
e  Riti     32      Delhi
d  Riti     33      Delhi
c  Riti     35     Mumbai
b  Jack     34     Sydney
a  Riti     31      Delhi

In [ ]:
# sorting in ascending order

df3.sort_index(axis=0, ascending=False)
#axis = 0 is by row

In [ ]:
#sort by column numbers

df3.sort_index(axis=1, ascending=True)
#axis = 1 is by column

In [ ]:
#sorting cyl in descending order
cars.sort_values(by='cyl', ascending=False)

### group by

In [ ]:
#group by

group_by_am = cars.groupby('am')
group_by_am.size() # how many elements are present in each group

In [ ]:
#group by

group_by_m = cars.groupby(['am', "gear"])
group_by_m.size() # how many elements are present in each group

### count values

In [ ]:
# value_count
# find the value counts
cars.am.value_counts()

In [ ]:
cars['Type'].value_counts()

In [ ]:
# importing file from a local folder
from google.colab import files
uploaded = files.upload()

Saving mtcars_missing.csv to mtcars_missing.csv

In [ ]:
mtcars = pd.read_csv("mtcars_missing.csv")
mtcars.head()

,Type,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110.0,3.90,NaN,16.46,0.0,1,4.0,4
1,Mazda RX4 Wag,21.0,6,NaN,110.0,3.90,2.875,17.02,0.0,1,NaN,4
2,Datsun 710,22.8,4,108.0,93.0,3.85,2.320,18.61,NaN,1,4.0,1
3,Hornet 4 Drive,21.4,6,258.0,NaN,3.08,3.215,19.44,1.0,0,3.0,1
4,Hornet Sportabout,18.7,8,360.0,175.0,3.15,3.440,17.02,0.0,0,3.0,2

In [ ]:
for col in ['vs', 'am', 'gear', 'carb']:
    mtcars[col] = mtcars[col].astype('category')
    
mtcars.info()

In [ ]:
mtcars.describe(include = 'all')

### Missing values

In [ ]:
mtcars.isnull().head() # if null true otherwise false
# true = 1 and false 0

In [ ]:
mtcars.isnull().sum() # if null true otherwise false
# true = 1 and false 0

In [ ]:
mtcars.notnull().head() # opposite of isnull

In [ ]:
# https://www.geeksforgeeks.org/working-with-missing-data-in-pandas/
fill_0 = mtcars.fillna(0)
fill_0.head()

In [ ]:
fill_mean = mtcars.fillna(mtcars.mean()) # replacing all columns with mean
fill_mean

In [ ]:
fill_mode = mtcars.fillna(mtcars.vs.mean()) # replacing all columns with mode
fill_mode

In [ ]:
mtcars_na = mtcars.dropna()
mtcars_na

### Correlation

In [ ]:
# Correlation
#find correlation matrix
df = cars[['mpg','cyl','disp','hp','wt','qsec']].corr()
df

### Filter columns

In [ ]:
## Filter records
cars_8_cyl = cars['cyl'] > 6
cars_8_cyl

In [ ]:
## Filter records
cars_6_cyl = cars[cars['cyl'] > 6]
cars_6_cyl

In [ ]:
# minimum mileage of 4 cylinder car
cars_4cyl = cars[cars.cyl == 4]
cars_4cyl[cars_4cyl.mpg == cars_4cyl.mpg.max()]

#cars_4cyl.mpg.min()

### Creating new columns

In [ ]:
# creating a new column
cars['Best'] = cars['mpg'] * cars['wt']
cars.head()

In [ ]:

cars['kpl'] = cars.apply(lambda mile: (mile.mpg * 0.43), axis = 1)
cars

In [ ]:
# creating a new column
cars['Best'] = cars['mpg'] * 0.43
cars.head()

### Encoding categorical value

In [ ]:
# encoding categorical variable
cars['am'].replace([0, 1], ['Automatic', 'Manual'], inplace = True)
cars

### Unique values

In [ ]:
cars.Type.unique()

### Duplicate values

In [ ]:
cars.drop_duplicates(inplace=True)

### Date column

In [ ]:
from datetime import datetime

In [3]:
df = pd.DataFrame({'date': ['14/05/2022', '15/05/2022', '21/05/2022'],
                   'Students': [45, 50, 52]})

df

         date  Students
0  14/05/2022        45
1  15/05/2022        50
2  21/05/2022        52

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      3 non-null      object
 1   Students  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [6]:
df['date'] = pd.to_datetime(df['date'])
df

        date  Students
0 2022-05-14        45
1 2022-05-15        50
2 2022-05-21        52

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   date      3 non-null      datetime64[ns]
 1   Students  3 non-null      int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 176.0 bytes

### Saving cleaned file

In [ ]:
# Saving final file
cars.to_csv("mtcars_cleaned.csv",index=False,header=True)

In [ ]:
# Saving final file
cars.to_excel("mtcars_cleaned.xlsx",index=False,header=True)

In [ ]:
# Saving final file
cars.to_csv("mtcars_cleaned",index=False,header=True)